lkolbly/cmsis-svd/data/NXP/LPC824.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCON</name>
      <description>LPC82x System configuration (SYSCON)</description>
      <groupName>SYSCON</groupName>
      <baseAddress>0x40048000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x3FC</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>BOD</name>
        <value>13</value>
      </interrupt>
      <registers>
        <register>
          <name>SYSMEMREMAP</name>
          <description>System Remap register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>MAP</name>
              <description>System memory remap. Value 0x3 is reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOOT_LOADER_MODE</name>
                  <description>Boot Loader Mode. Interrupt vectors are re-mapped to Boot ROM.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USER_RAM_MODE</name>
                  <description>User RAM Mode. Interrupt vectors are re-mapped to Static RAM.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USER_FLASH_MODE</name>
                  <description>User Flash Mode. Interrupt vectors are not re-mapped and reside in Flash.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRESETCTRL</name>
          <description>Peripheral reset control register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2101DFFF</resetValue>
          <resetMask>0x2101DFFF</resetMask>
          <fields>
            <field>
              <name>SPI0_RST_N</name>
              <description>SPI0 reset control.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI0_RST_N_0</name>
                  <description>Assert the SPI0 reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_RST_N_1</name>
                  <description>Clear the SPI0 reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPI1_RST_N</name>
              <description>SPI1 reset control.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SPI1_RST_N_0</name>
                  <description>Assert the SPI1 reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI1_RST_N_1</name>
                  <description>Clear the SPI1 reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UARTFRG_RST_N</name>
              <description>USART fractional baud rate generator(UARTFRG) reset control.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UARTFRG_RST_N_0</name>
                  <description>Assert the UARTFRG reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UARTFRG_RST_N_1</name>
                  <description>Clear the UARTFRG reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UART0_RST_N</name>
              <description>USART0 reset control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART0_RST_N_0</name>
                  <description>Assert the USART0 reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART0_RST_N_1</name>
                  <description>Clear the USART0 reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UART1_RST_N</name>
              <description>USART1 reset control.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART1_RST_N_0</name>
                  <description>Assert the USART1 reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART1_RST_N_1</name>
                  <description>Clear the USART1 reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UART2_RST_N</name>
              <description>USART2 reset control.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART2_RST_N_0</name>
                  <description>Assert the USART2 reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART2_RST_N_1</name>
                  <description>Clear the USART2 reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C0_RST_N</name>
              <description>I2C0 reset control.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2C0_RST_N_0</name>
                  <description>Assert the I2C0 reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0_RST_N_1</name>
                  <description>Clear the I2C0 reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MRT_RST_N</name>
              <description>Multi-rate timer (MRT) reset control.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MRT_RST_N_0</name>
                  <description>Assert the MRT reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MRT_RST_N_1</name>
                  <description>Clear the MRT reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCT_RST_N</name>
              <description>SCT reset control.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCT_RST_N_0</name>
                  <description>Assert the SCT reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCT_RST_N_1</name>
                  <description>Clear the SCT reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKT_RST_N</name>
              <description>Self-wake-up timer (WKT) reset control.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WKT_RST_N_0</name>
                  <description>Assert the WKT reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WKT_RST_N_1</name>
                  <description>Clear the WKT reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPIO_RST_N</name>
              <description>GPIO and GPIO pin interrupt reset control.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_RST_N_0</name>
                  <description>Assert the GPIO reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_RST_N_1</name>
                  <description>Clear the GPIO reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASH_RST_N</name>
              <description>Flash controller reset control.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLASH_RST_N_0</name>
                  <description>Assert the flash controller reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLASH_RST_N_1</name>
                  <description>Clear the flash controller reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP_RST_N</name>
              <description>Analog comparator reset control.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACMP_RST_N_0</name>
                  <description>Assert the analog comparator reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACMP_RST_N_1</name>
                  <description>Clear the analog comparator controller reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C1_RST_N</name>
              <description>I2C1 reset control.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2C1_RST_N_0</name>
                  <description>Assert the I2C1 reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1_RST_N_1</name>
                  <description>Clear the I2C1 reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C2_RST_N</name>
              <description>I2C2 reset control.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2C2_RST_N_0</name>
                  <description>Assert the I2C2 reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C2_RST_N_1</name>
                  <description>Clear the I2C2 reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C3_RST_N</name>
              <description>I2C3 reset control.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2C3_RST_N_0</name>
                  <description>Assert the I2C3 reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C3_RST_N_1</name>
                  <description>Clear the I2C3 reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_RST_N</name>
              <description>ADC reset control.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_RST_N_0</name>
                  <description>Assert the ADC reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_RST_N_1</name>
                  <description>Clear the ADC reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_RST_N</name>
              <description>DMA reset control.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_RST_N_0</name>
                  <description>Assert the DMA reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_RST_N_1</name>
                  <description>Clear the DMA reset.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSPLLCTRL</name>
          <description>PLL control</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x7F</resetMask>
          <fields>
            <field>
              <name>MSEL</name>
              <description>Feedback divider value. The division value M is the programmed MSEL value + 1. 00000: Division ratio M = 1 to 11111: Division ratio M = 32</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSEL</name>
              <description>Post divider ratio P. The division ratio is 2 x P.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PSEL_0</name>
                  <description>P = 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSEL_1</name>
                  <description>P = 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSEL_2</name>
                  <description>P = 4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSEL_3</name>
                  <description>P = 8</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSPLLSTAT</name>
          <description>PLL status</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>PLL0 lock indicator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSOSCCTRL</name>
          <description>system oscillator control</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BYPASS</name>
              <description>Bypass system oscillator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREQ_RANGE</name>
              <description>oscillator low / high transconductance selection input (Active High) 1-20MHz '0' : 15-50MHz '1'</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTOSCCTRL</name>
          <description>Watchdog oscillator control</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIVSEL</name>
              <description>Select divider for Fclkana. wdt_osc_clk = Fclkana/ (2 x (1 + DIVSEL)) 00000: 2 x (1 + DIVSEL) = 2 00001: 2 x (1 + DIVSEL) = 4 to 11111: 2 x (1 + DIVSEL) = 64</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREQSEL</name>
              <description>Frequency select. Selects the frequency of the oscillator. 0x00 = invalid setting when watchdog oscillator is running 0x1 = 0.6 MHz 0x2 = 1.05 MHz 0x3 = 1.4 MHz 0x4 = 1.75 MHz 0x5 = 2.1 MHz 0x6 = 2.4 MHz 0x7 = 2.7 MHz 0x8 = 3.0 MHz 0x9 = 3.25 MHz 0xA = 3.5 MHz 0xB = 3.75 MHz 0xC = 4.0 MHz 0xD = 4.2 MHz 0xE = 4.4 MHz 0xF = 4.6 MHz</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRCCTRL</name>
          <description>IRC control</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>TRIM</name>
              <description>Trim value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
